Pandas
Pandas -Open source library in Python
Data Manipulation and analysis

In [2]:
import numpy as np
import pandas as pd

Series - One dimensional
DataFrame-Multi dimensional

In [3]:
age=pd.Series([19,24,30,41,53])
age

0    19
1    24
2    30
3    41
4    53
dtype: int64

In [4]:
#### alternate code
age=pd.Series(np.array([19,24,30,41,53]))
age

0    19
1    24
2    30
3    41
4    53
dtype: int32

In [5]:
age=pd.Series(np.array([20,12,43,45,65,66]),index=np.arange(0,12,2))
age

0     20
2     12
4     43
6     45
8     65
10    66
dtype: int32

In [6]:
age=pd.Series(np.array([20,12,43,45,65,66]),index=["A1","A2","A3","A4","A5","A6"])
age

A1    20
A2    12
A3    43
A4    45
A5    65
A6    66
dtype: int32

In [7]:
prod={"Diary":23000,"Soft drinks":45000,"Fruits and Vegetables":67000}
prod1=pd.Series(prod)
prod1

Diary                    23000
Soft drinks              45000
Fruits and Vegetables    67000
dtype: int64

In [8]:
stud={'x':["Maths","Science","English"],'y':["Maths","Science"],'z':["Science"]}
sub=pd.Series(stud)
sub

x    [Maths, Science, English]
y             [Maths, Science]
z                    [Science]
dtype: object

In [9]:
sub[["x","y"]]

x    [Maths, Science, English]
y             [Maths, Science]
dtype: object

In [10]:
sub.index

Index(['x', 'y', 'z'], dtype='object')

In [11]:
sub.values

array([list(['Maths', 'Science', 'English']), list(['Maths', 'Science']),
       list(['Science'])], dtype=object)

In [12]:
emp=np.array(["A1","A2","A3","A4","A5","A6","A7","A8","A9"])
emp_series=pd.Series(emp)

In [13]:
emp

array(['A1', 'A2', 'A3', 'A4', 'A5', 'A6', 'A7', 'A8', 'A9'], dtype='<U2')

In [14]:
emp_series

0    A1
1    A2
2    A3
3    A4
4    A5
5    A6
6    A7
7    A8
8    A9
dtype: object

In [15]:
emp_series

0    A1
1    A2
2    A3
3    A4
4    A5
5    A6
6    A7
7    A8
8    A9
dtype: object

In [16]:
emp_series[:5]

0    A1
1    A2
2    A3
3    A4
4    A5
dtype: object

In [17]:
emp_series[:5]

0    A1
1    A2
2    A3
3    A4
4    A5
dtype: object

In [18]:
emp_series[-5:]

4    A5
5    A6
6    A7
7    A8
8    A9
dtype: object

In [19]:
stud={'Sophia': 450,'Mia': 303, 'Philip': 432,'Emma': 150,'Lily': 293,'Grace': 112}
stud_series=pd.Series(stud)
stud_series

Sophia    450
Mia       303
Philip    432
Emma      150
Lily      293
Grace     112
dtype: int64

In [20]:
stud_series[stud_series>300]

Sophia    450
Mia       303
Philip    432
dtype: int64

In [21]:
stud_series[stud_series<200]

Emma     150
Grace    112
dtype: int64

In [22]:
### between 200 and 300
stud_series[(stud_series>200) & (stud_series<300)]

Lily    293
dtype: int64

In [23]:
### Concatenation
class1=np.linspace(0,20,11)
class2=np.linspace(1,21,11)

In [24]:
class1_series=pd.Series(class1)
class2_series=pd.Series(class2)

In [25]:
pd.concat([class1_series,class2_series])

0      0.0
1      2.0
2      4.0
3      6.0
4      8.0
5     10.0
6     12.0
7     14.0
8     16.0
9     18.0
10    20.0
0      1.0
1      3.0
2      5.0
3      7.0
4      9.0
5     11.0
6     13.0
7     15.0
8     17.0
9     19.0
10    21.0
dtype: float64

In [26]:
pd.concat([class1_series,class2_series],keys=["Even","Odd"],names=["category","index"])

category  index
Even      0         0.0
          1         2.0
          2         4.0
          3         6.0
          4         8.0
          5        10.0
          6        12.0
          7        14.0
          8        16.0
          9        18.0
          10       20.0
Odd       0         1.0
          1         3.0
          2         5.0
          3         7.0
          4         9.0
          5        11.0
          6        13.0
          7        15.0
          8        17.0
          9        19.0
          10       21.0
dtype: float64

In [27]:
class1_series.append(class2_series,ignore_index=True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_12536\4230697910.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  class1_series.append(class2_series,ignore_index=True)

0      0.0
1      2.0
2      4.0
3      6.0
4      8.0
5     10.0
6     12.0
7     14.0
8     16.0
9     18.0
10    20.0
11     1.0
12     3.0
13     5.0
14     7.0
15     9.0
16    11.0
17    13.0
18    15.0
19    17.0
20    19.0
21    21.0
dtype: float64

In [28]:
### DataFrame 
d2={"Month":["Jan","Jan","Jan","Jan","Jan","Feb","Feb","Feb","Feb","March"],
   "Store":['A','B','C','D','E','A','B','C','D','A'],
   "Sales":[30124,65214,24550,34645,29314,6500,2900,4600,31500,14000]}

df1=pd.DataFrame(d2)
df1

   Month Store  Sales
0    Jan     A  30124
1    Jan     B  65214
2    Jan     C  24550
3    Jan     D  34645
4    Jan     E  29314
5    Feb     A   6500
6    Feb     B   2900
7    Feb     C   4600
8    Feb     D  31500
9  March     A  14000

In [29]:
df1.head()

  Month Store  Sales
0   Jan     A  30124
1   Jan     B  65214
2   Jan     C  24550
3   Jan     D  34645
4   Jan     E  29314

In [30]:
df1.tail()

   Month Store  Sales
5    Feb     A   6500
6    Feb     B   2900
7    Feb     C   4600
8    Feb     D  31500
9  March     A  14000

In [31]:
df1.shape

(10, 3)

In [32]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Month   10 non-null     object
 1   Store   10 non-null     object
 2   Sales   10 non-null     int64
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [33]:
df1.dtypes

Month    object
Store    object
Sales     int64
dtype: object

.iloc-> Retrieves the row and column by index
.loc->Retrieve row and column by name

In [34]:
df1.iloc[1]

Month      Jan
Store        B
Sales    65214
Name: 1, dtype: object

In [35]:
df1.iloc[0]

Month      Jan
Store        A
Sales    30124
Name: 0, dtype: object

In [36]:
df1.iloc[0]['Store']

'A'

In [37]:
df1.iloc[3:6]

  Month Store  Sales
3   Jan     D  34645
4   Jan     E  29314
5   Feb     A   6500

In [38]:
df1.iloc[:,2]

0    30124
1    65214
2    24550
3    34645
4    29314
5     6500
6     2900
7     4600
8    31500
9    14000
Name: Sales, dtype: int64

In [39]:
df1.iloc[:,1:]

  Store  Sales
0     A  30124
1     B  65214
2     C  24550
3     D  34645
4     E  29314
5     A   6500
6     B   2900
7     C   4600
8     D  31500
9     A  14000

In [40]:
df1.iloc[:,:2]

   Month Store
0    Jan     A
1    Jan     B
2    Jan     C
3    Jan     D
4    Jan     E
5    Feb     A
6    Feb     B
7    Feb     C
8    Feb     D
9  March     A

In [41]:
df1.iloc[:,[0,2]]

   Month  Sales
0    Jan  30124
1    Jan  65214
2    Jan  24550
3    Jan  34645
4    Jan  29314
5    Feb   6500
6    Feb   2900
7    Feb   4600
8    Feb  31500
9  March  14000

In [42]:
df1.loc[1]["Sales"]

65214

In [43]:
df1

   Month Store  Sales
0    Jan     A  30124
1    Jan     B  65214
2    Jan     C  24550
3    Jan     D  34645
4    Jan     E  29314
5    Feb     A   6500
6    Feb     B   2900
7    Feb     C   4600
8    Feb     D  31500
9  March     A  14000

In [44]:
df1.loc[[0,1,2],["Store","Sales"]]

  Store  Sales
0     A  30124
1     B  65214
2     C  24550

In [45]:
### sales>30000
df1[df1.Sales>30000]

  Month Store  Sales
0   Jan     A  30124
1   Jan     B  65214
3   Jan     D  34645
8   Feb     D  31500

In [46]:
### Get the January month sales when >30000
df1[(df1.Month=="Jan")&(df1.Sales>30000)]

  Month Store  Sales
0   Jan     A  30124
1   Jan     B  65214
3   Jan     D  34645

In [47]:
df1.sort_values("Sales")

   Month Store  Sales
6    Feb     B   2900
7    Feb     C   4600
5    Feb     A   6500
9  March     A  14000
2    Jan     C  24550
4    Jan     E  29314
0    Jan     A  30124
8    Feb     D  31500
3    Jan     D  34645
1    Jan     B  65214